alexjgUFOP/BCC722-RTOS-moinho/UCoS/Micrium_2/Software/EvalBoards/Cypress/CY8CKIT-050/PSoC/uCOS-III-Probe/Pratica03-uCOS-III.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "LED_Status.h"
#include "LED_aliases.h"
#include "LED.h"
#include "LCD_Disp.h"
#include "PB_2_aliases.h"
#include "PB_2.h"
#include "ProbeUART.h"
#include "ProbeUART_Rx_aliases.h"
#include "ProbeUART_Rx.h"
#include "ProbeUART_Tx_aliases.h"
#include "ProbeUART_Tx.h"
#include "ProbeUART_TxISR.h"
#include "ProbeUART_RxISR.h"
#include "PB_3_aliases.h"
#include "PB_3.h"
#include "Pin_SV01_VE_aliases.h"
#include "Pin_SV01_VE.h"
#include "Pin_BP01_aliases.h"
#include "Pin_BP01.h"
#include "Pin_SP01_VE_aliases.h"
#include "Pin_SP01_VE.h"
#include "Pin_SV01_AM_aliases.h"
#include "Pin_SV01_AM.h"
#include "Pin_SV01_VM_aliases.h"
#include "Pin_SV01_VM.h"
#include "Pin_SP01_VM_aliases.h"
#include "Pin_SP01_VM.h"
#include "Pin_BP01_int.h"
#include "Pin_SV02_VE_aliases.h"
#include "Pin_SV02_VE.h"
#include "Pin_BP02_aliases.h"
#include "Pin_BP02.h"
#include "Pin_SP02_VE_aliases.h"
#include "Pin_SP02_VE.h"
#include "Pin_SV02_AM_aliases.h"
#include "Pin_SV02_AM.h"
#include "Pin_SV02_VM_aliases.h"
#include "Pin_SV02_VM.h"
#include "Pin_SP02_VM_aliases.h"
#include "Pin_SP02_VM.h"
#include "Pin_BP02_int.h"
#include "LCD_Disp_LCDPort_aliases.h"
#include "LCD_Disp_LCDPort.h"
#include "ProbeUART_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

